[
    {
        "name": "Lightning",
        "description": "Lightning Release (Raiton) is one of the five basic nature transformations. In order to perform most Lightning Release jutsu, users must convert their chakra into electricity. One of the simpler ways to use this electricity is to channel it into ninja tools, increasing the weapon's cutting power by making it vibrate or causing a numbing effect to those the weapons contact. For the Chidori (and the Lightning Cutter), Kakashi Hatake simply gathers the lightning chakra to his hand, causing severe piercing damage to anything or anyone his hand touches. Sasuke Uchiha sometimes makes broader use of the Chidori's chakra, such as giving it shape so he can attack from greater distances or emitting it around himself to attack those nearby. Less commonly, users can instead take control of natural lightning, as Sasuke does with Kirin; because natural lightning can be difficult to come across, he uses Fire Release in order to produce ideal weather conditions for lightning. Lightning Release is common among ninja of Kumogakure, who make varied applications of it: C uses lightning as a medium for genjutsu, making it easier to entrance opponents; Darui generates a unique Black Lightning, which he learned from the Third Raikage; the Fourth Raikage uses Lightning Release Chakra Mode by coating his body with electricity, which shields him from harm, increases his speed, and enhances the strength of his physical attacks. The Third Raikage's Hell Stab, usable with his own Chakra Mode, is so powerful as to referred to as the \"strongest spear\". In Naruto Shinden: Parent and Child Day, Chōji Akimichi says it's a bad idea for Lightning Release users to wear metallic accessories, such as earrings. Lightning Release is naturally strong against Earth Release and weak against Wind Release. If Lightning Release is used with Water Release, the water can increase the range of the lightning, or the lightning can give the water a numbing quality. Individuals who make heavy use of Water Release, such as members of the Hōzuki clan, are similarly very vulnerable to Lightning Release. When Lightning Release is combined with other natures, certain kekkei genkai are produced: lightning and water make Storm Release; lightning and earth are suggested to make Explosion Release."
    },
    {
        "name": "Earth",
        "description": "Earth Release (Doton) is one of the five basic nature transformations. Earth Release is commonly affiliated with the Snake hand seal. Earth Release encompasses any earthen material, from dirt to stone to clay, and in fact often entails changing one to another. For most Earth Release jutsu, users place their hands on the ground and use their chakra to alter its form. Less commonly, users create earth within their bodies, which they eject from their mouth. Simpler applications of Earth Release involve changing the terrain around the user. Offensively, Earth Release can be clumped together for use as a projectile or broken up to create hazards for enemies. Targets can be trapped by creating an rock dome around them or a muddy pit that they sink into. Defensively, earth can be raised around the user as a fortification against attack, Earth-Style Wall being one of the more common options. Alternatively, Earth Release users can burrow underground in order to escape harm and, indeed, combat. Earth Release is common among ninja of Iwagakure, who make varied applications of it: Deidara's Explosive Clay is partly-earth based, meaning it can be countered in the same way as Earth Release; Ōnoki, by touching targets, can make them too heavy to move or so light that they can fly; Akatsuchi creates Rock Golems to fight alongside himself and his allies; Kitsuchi uses a mountain's worth of earth to crush targets. During the Third Shinobi World War, Obito Uchiha was believed to be killed because of an Iwa-nin's cave-in, a favourite tactic of the village's ninja. Earth Release is naturally strong against Water Release and weak against Lightning Release. When Earth Release is combined with other natures, certain kekkei genkai are produced: earth and water make Wood Release; earth and fire make Lava Release; earth and wind are suggested to make Magnet Release; earth and lightning are suggested to make Explosion Release; earth is suggested to have some role in Crystal Release; in Akatsuki Hiden, earth and water make Mud Release. The combination of earth, wind, and fire produces the kekkei tōta, Dust Release."
    },
    {
        "name": "Fire",
        "description": "Fire Release (Katon) is one of the five basic nature transformations. Fire Release is commonly affiliated with the Tiger hand seal. Fire Release is almost always used offensively, typically by kneading chakra in the body into flames that the user breathes from the mouth. Simpler applications of Fire Release include creating a stream of fire, or alternatively breaking the stream into bursts of flames. Once produced, the fire can be shaped or otherwise manipulated, but exerting such control requires careful skill. If the flames are channeled into a weapons, such as a sword, that allows the user greater finesse with how the fire is spread. Fire Release can take the form of ash clouds that linger in the air, burning and blinding those caught in it, or be erected as a shield, burning away anything that tries to cross it. Less commonly, Fire Release encompasses using flames from other sources, such as exploding tags, with users focusing the explosions against opponents. Fire Release is common among ninja of Konohagakure: Jiraiya frequently uses Fire Release in combination with his summoned toads, the toads' oil increasing the flame's heat and range; members of the Uchiha clan are not considered adults until they've learned to perform the Great Fireball Technique, and with practice they can generate flames strong enough to overcome Water Release; members of the Sarutobi clan frequently use Fire Release, and in fact Fire Release: Great Flame Technique is considered a hiden ability of the clan. Fire Release is naturally strong against Wind Release and weak against Water Release. Fire's strength over wind makes it an effective way to, when used collaboratively, make flames more powerful. If enough Fire Release techniques are used, that can create ideal weather conditions for Lightning Release, such as Kirin. When Fire Release is combined with other natures, certain kekkei genkai are produced: fire and earth make Lava Release; fire and water make Boil Release; fire and wind make Scorch Release. The combination of fire, earth, and wind produces the kekkei tōta, Dust Release."
    },
    {
        "name": "Water",
        "description": "Water Release (Suiton) is one of the five basic nature transformations. Water Release jutsu are most easily performed using existing water sources, such as lakes or rivers. Users can also create water within their bodies with chakra, which they expel from their mouths, though this is generally regarded as a testament of skill; Tobirama Senju's ability to produce his own water is noted to be proof of his position as Hokage. Water Release is typically used offensively, doing battering damage because of the sheer volume of water or slicing damage because of the water's high pressure. Water Release can be used to trap targets, such as imprisoning them with dense water or ensnaring them with sticky water. Defensively, Water Formation Wall is a common option, with users surrounding themselves with water to be protected from harm. Alternatively, users can hide themselves from opponents with thick mist to obscure vision or water droplets to render the user invisible. Water Release is common among ninja of Kirigakure, with the Water Clone Technique being one of the village's trademark techniques. Various Kiri-nin utilise Water Release in characteristic ways: Kisame Hoshigaki frequently shapes his water into sharks, such as the Water Shark Bullet; members of the Hōzuki clan use the Hydrification Technique to turn their bodies into water, such as to alter their body or shoot it from their hands; Utakata uses Soap Bubble Ninjutsu, which he employs for various purposes. Water Release is naturally strong against Fire Release and weak against Earth Release. If Water Release is used with Wind Release, as with the Typhoon Water Vortex Technique, the wind churns the water, increasing its damage and coverage area. If Water Release is used with Lightning Release, the water can increase the range of the lightning, or the lightning can give the water a numbing quality; in Sasuke Shinden, Sasuke Uchiha purifies all his Water Release in order to minimise its conductivity of lightning. When Water Release is combined with other natures, certain kekkei genkai are produced: water and wind make Ice Release; water and earth make Wood Release; water and lightning make Storm Release; water and fire make Boil Release; in Akatsuki Hiden, water and earth make Mud Release."
    },
    {
        "name": "Wind",
        "description": "Wind Release (Fūton) is one of the five basic nature transformations. Wind Release is the rarest of the five nature transformations, but those who can use it are able to cut through anything. Asuma Sarutobi uses it by channeling wind chakra into his Chakra Blades, making the blades far sharper and giving them greater reach. Wind Release can also be exhaled from the user's mouth, such as to blow away everything in the area, or generated with the user's hands, allowing precision strikes. Although Wind Release has naturally good range and power, it can be further enhanced by compressing it or layering different wind streams together. Wind Release can easily launch particles into the air, whether to create dust clouds that conceal the user's movements or sand storms that perforate targets. Naruto Uzumaki adds Wind Release to the Rasengan so that he can throw it, as seen with its Rasenshuriken variant. Temari, rather than create winds on her own, instead generates wind by waving her Giant Folding Fan at targets; Temari's summon, Kamatari, rides these wind currents towards her opponents so that it can slice them apart. This practice of using fans to create wind is seemingly common to Sunagakure ninja. Wind Release is naturally strong against Lightning Release and weak against Fire Release. Wind's weakness to fire makes it an effective way to, when used collaboratively, make flames more powerful. If Wind Release is used with Water Release, as with the Typhoon Water Vortex Technique, the wind churns the water, increasing its damage and coverage area. When Wind Release is combined with other natures, certain kekkei genkai are produced: wind and water make Ice Release; wind and fire make Scorch Release; wind and earth are suggested to make Magnet Release. The combination of wind, earth, and fire produces the kekkei tōta, Dust Release."
    },
    {
        "name": "Yin",
        "description": "Yin Release (Inton) is a nature transformation that exists outside the five basic elemental natures. Like its counterpart, Yang Release, Yin Release is little-explored in the series. Yin Release uses spiritual energy to control imagination, creating form out of nothingness. Hagoromo Ōtsutsuki combined Yin and Yang into Yin–Yang Release, notably allowing him to create the nine tailed beasts. Yin Release has tended to be inherited among the Uchiha clan, descendants of Hagoromo. Jin no Sho notes, however, that Uchiha clansmen don't usually make any significant use of Yin Release. Certain other clans employ Yin Release via their hiden skills, notably the Nara clan, who use Yin Release to manipulate their own shadows. Most genjutsu also fall under the categorisation of Yin Release. There have been occasional miscellaneous mentions of Yin Release: Minato Namikaze split the Nine-Tails' Yin and Yang chakra, sealing its Yin half within himself and thus becoming its jinchūriki; Hagoromo's spirit gives his Six Paths Yin Power to Sasuke Uchiha, which takes the form of a crescent moon marking on his left palm; Madara Uchiha, after acquiring Six Paths Senjutsu, uses Yin Release through his Sage Art: Yin Release Lightning Dispatch."
    },
    {
        "name": "Yang",
        "description": "Yang Release (Yōton) is a nature transformation that exists outside the five basic elemental natures. Like its counterpart, Yin Release, Yang Release is little-explored in the series. Yang Release uses physical energy to control vitality, granting life to forms that have none. Hagoromo Ōtsutsuki combined Yin and Yang into Yin–Yang Release, notably allowing him to create the nine tailed beasts. Yang Release has tended to be inherited among the Senju clan, descendants of Hagoromo. Jin no Sho notes, however, that Senju clansmen don't usually make any significant use of Yang Release. Certain other clans employ Yang Release via their hiden skills, notably the Akimichi clan, who use Yang Release to increase the size of their own bodies. There have been occasional miscellaneous mentions of Yang Release: Minato Namikaze split the Nine-Tails' Yin and Yang chakra, sealing its Yang half within Naruto Uzumaki to make him its jinchūriki; when Naruto uses the Nine-Tails' chakra via his Nine-Tails Chakra Mode, any wood constructs that he is near or that he touches grow into trees; Hagoromo's spirit gives his Six Paths Yang Power to Naruto, which takes the form of a sun marking on his right palm."
    }
]
