[
    {
        "name": "Wood",
        "description": "Wood Release (Mokuton) is a nature transformation kekkei genkai, a combination of earth and water. It was famously used by Hashirama Senju, and in fact is not known to have naturally occurred in anyone else. Because of Wood Release's power and versatility, there have been various efforts to reproduce it after Hashirama's death. Wood Release techniques are commonly affiliated with the Snake hand seal. At its simplest, Wood Release allows the user to create wood, essentially converting their chakra into a source of life before, at it greatest, becoming mighty trees of various size and shape. The vegetation can sprout from the user's body or grow from the surroundings; Hashirama created a forest that served as a foundation for Konohagakure, contributing to his selection as First Hokage. Wooden constructs can also be created, ranging in complexity from cages to complete houses. It is not necessary that the created wood take any identifiable form, allowing users to focus on its inherent pliability to ensnare targets or its durability for brute force attacks. Wood Release can produce very detailed, ornate constructs. Wood Release: Transformation essentially creates a costume around the user, allowing them to convincingly pass as another person. By using senjutsu, Hashirama could create a gigantic, many-armed wooden statue that he fully controlled; its barrage of punches were chiefly responsible for the Valley of the End's formation. Wood Release's most versatile application is the Wood Clone Technique, which makes a fully-functional duplicate of the user that is indistinguishable from the original and is even capable of performing other jutsu. The Wood Release was also equally famous for its power to manipulate, suppress, and/or absorb a targets chakra. Hashirama's mastery of this ability earning him recognition as one of the few people able to fully control a tailed beast. This would be done by ensnaring a target with the Wood Release and upon such physical contact would then control the chakra until they were finally too weak to escape. Hashirama's usage of this skill let him subdue many of the tailed beasts, keeping them under his control and allowed him to distribute several to the early hidden villages.",
        "clan": ["Ōtsutsuki", "Senju"],
        "classfication": "Nature Type",
        "basicTypes": ["Water", "Earth"]
    },
    {
        "name": "Storm",
        "description": "Storm Release (Ranton) is a nature transformation kekkei genkai, a combination of lightning and water. It is used by several shinobi from Kumogakure, most notably Darui. Despite its name, Storm Release does not manipulate actual storms; it instead manipulates beams of electricity which flow like water.",
        "classfication": "Nature Type",
        "basicTypes": ["Lightning", "Water"]
    },
    {
        "name": "Explosion",
        "description": "Explosion Release (Bakuton) is a nature transformation kekkei genkai, suggested to be a combination of earth and lightning. Explosion Release users utilise explosive chakra in combat. It is seemingly common to members of Iwagakure's Explosion Corps.",
        "classfication": "Nature Type",
        "basicTypes": ["Lightning", "Earth"]
    },
    {
        "name": "Lava",
        "description": "Lava Release (Yōton) is a nature transformation kekkei genkai, a combination of fire and earth. Whereas most kekkei genkai are largely identical between users, Lava Release has a variety of forms depending on who's using it.",
        "classfication": "Nature Type",
        "basicTypes": ["Earth", "Fire"]
    },
    {
        "name": "Magnet",
        "description": "Magnet Release (Jiton) is a nature transformation kekkei genkai, suggested to be a combination of wind and earth. Magnet Release users generate a magnetic force which they apply to other substances for various purposes.",
        "clan": ["Kazekage"],
        "classfication": "Nature Type",
        "basicTypes": ["Wind", "Earth"]
    },
    {
        "name": "Crystal",
        "description": "Crystal Release (Shōton) is a rare nature that is seen only in the anime. The actual natures that comprise the element is unknown. However, when Kiba Inuzuka first sees a Crystal Release structure, he mistakes it for Earth Release. Crystal Release is in fact shown being defeated by Lightning Release on one occasion, suggesting Earth Release may be a component element. Users of Crystal Release can convert any matter into pink, jade-green, red, or blue coloured crystals, from physical material to moisture in the air, allowing them to turn anything into a weapon. This extends to other physical natures, rendering earth, water, and wood useless against it. When used on living creatures, targets can be crystallised down to the cellular level, imprisoning them so long as the crystals are in place and shattering them if the crystals are struck, killing them. Crystal Release users can also manipulate pre-existing crystals and crystalline structures. Crystal Release cannot crystallise raw energy or chakra, as they have no physical mass to crystallise, allowing those with good chakra control or the lightning or fire natures to counter it. Crystal Release is also susceptible to a specific sound wave frequency: because crystal requires a very precise build-up of molecules, the proper sound waves can break down the build-up before the crystal can properly form; Rinji takes advantage of this weakness using his bats.",
        "classfication": "Nature Type"
    },
    {
        "name": "Ice",
        "description": "Ice Release (Hyōton) is a nature transformation kekkei genkai, a combination of water and wind. The Land of Water's Yuki clan was feared for the power of their Ice Release, forcing its members to go into hiding to escape persecution. In Kakashi Hiden, Kahyō and Rahyō‎‎ are ‎‎ice users whose family was conquered by Kirigakure decades earlier. Because Kiri did not value their lives, they both defected and settled in the Land of Waves. In the Boruto anime, Ryōgi from the Land of Snow can use Ice Release. Haku, a descendant of the Yuki clan, can make mirrors of ice that he is able to enter and instantly travel between. His ice is resistant to fire, experiencing little to no melting despite the heat. Kahyō can plant ice particles on targets, causing them to freeze to death if they don't constantly use their chakra to keep themselves warm. Her Ice Release is dependent on moisture in the air, preventing her from forming ice in dry conditions. Rahyō encases his hands with ice, strengthening his taijutsu strikes and making it easier for him to block opponents' taijutsu. Ryōgi can shoot shards of ice at targets. An Ice Release user's presence can lower their surroundings' temperature, causing snow to fall in the immediate vicinity. Similarly, Ryōgi is shown lowering his own body temperature so that his movements will not activate thermal sensors.",
        "classfication": "Nature Type",
        "basicTypes": ["Wind", "Water"]
    },
    {
        "name": "Boil",
        "description": "Boil Release (Futton) is a nature transformation kekkei genkai, a combination of fire and water. Whereas most kekkei genkai are largely identical between users, Boil Release has different forms depending on who's using it.",
        "classfication": "Nature Type",
        "basicTypes": ["Fire", "Water"]
    },
    {
        "name": "Dust",
        "description": "Dust Release (Jinton) is a nature transformation kekkei tōta, a combination of earth, wind, and fire. To perform Dust Release, users form a small three-dimensional object (e.g. a cube, a cone, etc.) out of chakra in their hands. The object expands once released by the user and moves astonishingly fast at its target; anything that passes through it (or that is passed through by it) is disintegrated on a molecular level. Because of the sheer destructiveness of Dust Release, its users are usually unmatched in a fight and they can easily fend off countless enemies. For this reason, the best way to combat one Dust Release user is with a second Dust Release user. Dust Release techniques seem to require a certain amount of preparation time, making it possible to prematurely halt the technique before it is completed. The hands also play a crucial role in the preparation, so interfering with the user's arms can hinder the technique. Dust Release techniques seem to be rather chakra-taxing.",
        "classfication": "Nature Type",
        "basicTypes": ["Fire", "Wind", "Earth"]
    },
    {
        "name": "Scorch",
        "description": "Scorch Release (Shakuton) is a nature transformation kekkei genkai. When Sasuke Uchiha and Naruto Uzumaki combine their fire and wind-natured techniques, the resulting technique is dubbed \"Scorch Release\", suggesting those are its component natures. Pakura of Sunagakure uses Scorch Release to heat up a target's body, causing all the liquid in their body to evaporate and leave them as a desiccated corpse. In the anime, her Scorch Release is weak against Water Release.",
        "classfication": "Nature Type",
        "basicTypes": ["Fire", "Wind"]
    },
    {
        "name": "Byakugan",
        "description": "The Byakugan is a kekkei genkai dōjutsu that originated from the Ōtsutsuki clan. After the Ōtsutsuki settled on Earth,basicTypes the Byakugan became more commonly associated with the Hyūga clan,basicTypes descendants of the Ōtsutsuki. It is regarded as one of the \"Three Great Dōjutsu\", the others being the Sharingan and the Rinnegan. Unlike dōjutsu such as the Sharingan, which do not manifest until users meet certain conditions,basicTypes the Byakugan is present from the time of birth. Individuals with the Byakugan are typically identifiable by their unique eyes: the irides are enlarged and white (a light shade of lavender in the anime), and there are no distinguishable pupils. When users activate their Byakugan, the pupils become more distinct and the increased blood flow to their eyes causes the veins near their temples to bulge. The Byakugan's array of abilities have rendered it highly coveted. Kumogakure has made various attempts to acquire and study the Byakugan over the years, notably during the Hyūga Affair. Ao of Kirigakure was able to acquire a single Byakugan from a Hyūga he defeated,basicTypes which he goes to great lengths to protect;basicTypes unlike other dōjutsu that have been transplanted, Ao can activate and deactivate his Byakugan at will. When Danzō Shimura of Konohagakure learns of Ao's Byakugan, he makes immediate plans to either destroy it or take it for himself. In order to prevent the Byakugan from being acquired by enemies, the Hyūga clan developed a practice of applying cursed seals to most of its members; when those branded with the cursed seal die, their Byakugan are destroyed. The anime implies that simply possessing a Byakugan is not enough to be able to use its powers, and that one must undergo intense training before the Byakugan can be activated, something not all users can accomplish. The anime likewise shows the Byakugan activating automatically if the user is under stressful circumstances, even if they haven't learned how to activate it on their own. Once a user does become able to use the Byakugan, they must avoid using it excessively, otherwise they will be rendered unable to keep it active until they've taken time to rest.",
        "classfication": "Dōjutsu",
        "clan": ["Ōtsutsuki", "Hyūga"],
        "image": [
            "https://vignette.wikia.nocookie.net/naruto/images/7/73/Byakugan.svg/revision/latest?cb=20090331090108",
            "https://vignette.wikia.nocookie.net/naruto/images/1/18/Byakugan.png/revision/latest?cb=20150314104523"
        ]
    },
    {
        "name": "Jōgan",
        "description": "The Jōgan is a unique dōjutsu that is known only by the Ōtsutsuki Clan, whose members claim it's troublesome and that it's a power strongly inherited from their clan.  In the manga the dōjutsu is featureless in appearance with a barely visible pupil. When depicted in the anime, the dōjutsu is blue in colour with a darkened sclera and visible pupil. When first used during his time in the Academy, Boruto did not appear to have the ability to activate it on command; instead, the eye would involuntarily activate when Boruto focused his attention on a particular person or object. As a teenager, he displayed the ability to activate it at will.",
        "classfication": "Dōjutsu",
        "image": [
            "https://vignette.wikia.nocookie.net/naruto/images/5/51/J%C5%8Dgan.svg/revision/latest?cb=20170910155536",
            "https://vignette.wikia.nocookie.net/naruto/images/8/8b/Boruto%27s_Eye.png/revision/latest?cb=20170406113713"
        ]
    },
    {
        "name": "Ketsuryūgan",
        "description": "The Ketsuryūgan, is a dōjutsu, which appears in certain individuals of the Chinoike clan. The Ketsuryūgan is recognised by its reddish colour, giving a special appearance for the users of this dōjutsu, characterised as holders of \"eyes as red as blood\". Its power earned it comparison to the Three Great Dōjutsu. The Ketsuryūgan confers genjutsu casting abilities, either by making physical skin contact with the target or meeting each other's gaze. Upon which, they can hypnotise the victim in a variety of ways, or even delve deep into their minds to extract information. The Ketsuryūgan also gave the users the ability to manipulate iron, or more accurately, any liquid with a high iron concentration. As such, fitting with its moniker, the Ketsuryūgan can manipulate the blood within a living target, whether if be themselves or another being.",
        "classfication": "Dōjutsu",
        "clan": ["Chinoike"],
        "image": [
            "https://vignette.wikia.nocookie.net/naruto/images/c/c2/Ketsury%C5%ABgan_Symbol.svg/revision/latest?cb=20161216133420"
        ]
    },
    {
        "name": "Sharingan",
        "description": "The Sharingan is the dōjutsu kekkei genkai of the Uchiha clan that appears selectively among its members. It is regarded as one of the \"Three Great Dōjutsu\", the others being the Byakugan and the Rinnegan. While its powers originated from Kaguya Ōtsutsuki's Rinne Sharingan, its independent form was first manifested by Indra Ōtsutsuki (Hagoromo Ōtsutsuki in the anime). When a wielder of this kekkei genkai experiences a powerful emotional condition with regards to a person precious to them, their brain releases a special form of chakra that affects the optic nerves, transforming the eyes into Sharingan; for that reason the Sharingan is described as an \"eye that reflects the heart\" (Kokoro o utsusu hitomi). Often, as per the Uchiha's so-called \"Curse of Hatred\", this emotion is a negative one, brought on by stress or loss. The emotion can also be positive, driven by a desire to protect or reunite with a loved one. In the anime, it was shown that usually after first acquiring this power, the user's enhanced perception will throw off their timing, causing them to overstress their bodies from trying to keep up with the increased reaction time, forcing the user to adjust to properly move with it. It was also shown during emotional states that begin to trigger the Sharingan's awakening, it can temporarily blur the person's eyesight until finally manifesting. Assuming that the user is aware they have awakened the Sharingan, they are thereafter able to freely use it. When first awakened, each Sharingan usually will have only one tomoe, although in Obito Uchiha's case, as well as Itachi and Indra's in the anime, they immediately gained two tomoe in each of their eyes. Through training and continued use, the Sharingan will develop a second tomoe and then, upon full maturation, a third. With full maturation, the Sharingan's ability to read the opponent's movements is fully developed, which can cause the user's movements to drastically differ from their earlier movements if their Sharingan matured mid-battle. When Hagoromo awakened the Sharingan in the anime, he had all three tomoe immediately. All the Sharingan's abilities are available to the user from its earliest stage, but with greater development comes greater proficiency with those abilities. As with any dōjutsu, Sharingan can be transplanted into non-Uchiha. They are unable to deactivate it and its use has a greater chakra demand for them than for actual Uchiha, who need only minimal chakra to keep it active. For these reasons, non-Uchiha tend to cover their Sharingan when they aren't using it in order to conserve chakra. Sharingan that originate from the same Uchiha are still linked to some extent even when wielded by separate users, at times enabling those users to see the same things.",
        "classfication": "Dōjutsu",
        "clan": ["Uchiha"],
        "image": [
            "https://vignette.wikia.nocookie.net/naruto/images/5/56/Sharingan_Triple.svg/revision/latest?cb=20091022225716"
        ]
    },
    {
        "name": "Mangekyō Sharingan",
        "description": "The Mangekyō Sharingan is an advanced form of the Sharingan that has only been activated by a handful of Uchiha. They are noted to be the \"heavenly eyes that see the truth of all of creation without obstruction\" (tenjō no kotowari o shōakuseshi hitomi). A Mangekyō Sharingan is distinguished from a normal Sharingan by its appearance, which changes the form of the tomoe seal. While the exact design differs for each user, though all resemble pinwheels. It is initially awakened by the trauma suffered from witnessing the death of someone close to the user. Uchiha have historically misunderstood this criteria as the user needing to be responsible for the person's death, and for that reason they developed the practice of killing their closest friends in order to gain the Mangekyō Sharingan. Obito's Mangekyō activated immediately after his trauma, whereas, in Naruto Jinraiden, Sasuke's Mangekyō didn't activate until several weeks afterwards. The Mangekyō Sharingan retains all of the Sharingan's generic abilities. In addition to that, the Mangekyō grants powerful abilities that differ between each eye, though abilities may be similar in nature; both Sasuke and Itachi have access to Amaterasu's flames, though the extent to which they can use them differ. The abilities of a Mangekyō Sharingan may not even be the same for both of a single user's eyes, as Itachi has Amaterasu in one eye and Tsukuyomi in another. As each eye houses the particular dōjutsu techniques, one can only access them if they currently house the said eye, even if they were the originator of the said technique. Once a user awakens the Mangekyō in both eyes, they are able to perform Susanoo, even without either eye. In addition to the unique techniques, the straight tomoe (choku tomoe) of Madara's and Sasuke's Mangekyō Sharingan grants them greater fluidity in their movements when fighting. Madara was able to sense this form and later deduced that he and Sasuke must be connected by more than blood. As with any dōjutsu, Mangekyō Sharingan can be transplanted into non-Uchiha, granting them all its abilities albeit with steeper chakra demands. Abilities of a Mangekyō Sharingan can also be programmed to activate under certain circumstances, either within the user's own eyes or in a target of the user's choosing; this programming remains even after death. Using them comes with a certain sensation that sensors can feel, although it doesn't show which technique is being prepared. Even for true wielders, usage of the Mangekyō Sharingan's abilities can cause a great strain on the user. It drains a considerable amount of chakra when simply activating and maintaining the advanced dōjutsu, and even more through each technique used. Even more, it can cause considerable damage to their being, leaving the body in agonising pain and causing deterioration to their vision until eventually over-usage leaves them blind. Their vision can be restored by transplanting the Mangekyō Sharingan of an Uchiha with strong blood ties — ideally a sibling — thus awakening the so-called Eternal Mangekyō Sharingan (Eien no Mangekyō Sharingan). Unlike with other transplants, this second evolution will allow the user to retain their original techniques in addition to access the new eyes' respective technique. Although these eyes merge the designs of the two Uchiha's Mangekyō Sharingan, they're still the eyes of the previous owner and thus react to certain techniques that are aimed at the original owner's Mangekyō Sharingan. Also, they no longer suffer any negative side-effects from using them, even reducing chakra-draining to an unnoticeably minimal level. According to Madara, the Eternal Mangekyō Sharingan is proof an Uchiha has continued to push forward despite experiencing great losses. The Mangekyō Sharingan also grants its user the ability to read and decode the Uchiha Clan's Stone Tablet. According to Obito, the Mangekyō Sharingan can decode it more than the Sharingan, but less than the Rinnegan.",
        "classfication": "Dōjutsu",
        "clan": ["Ōtsutsuki", "Uchiha"],
        "image": [
            "https://vignette.wikia.nocookie.net/naruto/images/5/52/Mangeky%C5%8D_Sharingan_Itachi.svg/revision/latest?cb=20110803151309",
            "https://vignette.wikia.nocookie.net/naruto/images/e/e0/Mangeky%C5%8D_Sharingan_Kakashi.svg/revision/latest/scale-to-width-down/120?cb=20140427104242",
            "https://vignette.wikia.nocookie.net/naruto/images/2/22/Mangeky%C5%8D_Sharingan_Madara.svg/revision/latest/scale-to-width-down/120?cb=20110803161535",
            "https://vignette.wikia.nocookie.net/naruto/images/8/86/Mangeky%C5%8D_Sharingan_Izuna.svg/revision/latest/scale-to-width-down/120?cb=20110803151423",
            "https://vignette.wikia.nocookie.net/naruto/images/5/55/Mangeky%C5%8D_Sharingan_Sasuke.svg/revision/latest/scale-to-width-down/120?cb=20171226184019",
            "https://vignette.wikia.nocookie.net/naruto/images/8/81/Mangeky%C5%8D_Sharingan_Shisui.svg/revision/latest/scale-to-width-down/120?cb=20110803165331"
        ]
    },
    {
        "name": "Rinnegan",
        "description": "The Rinnegan is reputed as the most exalted eye amongst the \"Three Great Dōjutsu\", the others being the Sharingan and the Byakugan. It is said that in times of disorder, one who wields the Rinnegan is sent down from the heavens to become either a \"God of Creation\" who will calm the world or a \"God of Destruction\" who will reduce everything to nothingness. The Rinnegan is characterised by a ripple pattern that spreads over the eyeball. The first person on Earth to wield the Rinnegan was Hagoromo Ōtsutsuki, whose mother possessed the Rinne Sharingan. In the anime, he obtained his Rinnegan at the same time as his Mangekyō Sharingan, which awakened as a result of mortally wounding his brother. Using the power of the Rinnegan, Hagoromo saved the world from the Ten-Tails and created ninshū, the precursor to modern ninjutsu. For his contributions to the world, Hagoromo became revered as the Sage of Six Paths, and both he and his eyes rose to mythological status following his death; even when the Rinnegan was later proven to exist, some dismissed it as a random mutation. It is possible to awaken a new Rinnegan by obtaining Hagoromo's chakra, either by combining the chakra of his sons, Indra and Asura, to recreate his own, or by directly receiving it from Hagoromo himself. Black Zetsu spent centuries attempting to manipulate the reincarnations of Indra and Asura into awakening the Rinnegan, but it was not until the time of Madara Uchiha — Indra's reincarnate — that this was successful. Madara implanted the flesh of Hashirama Senju — Asura's reincarnate — into his own body, causing a part of Asura's chakra to combine with Indra's. However, Madara's eyes did not become Rinnegan until decades later, when his natural lifespan was nearing its end; this also restored his right eye's vision, which had been lost from his earlier use of Izanagi. Orochimaru and Kabuto Yakushi later hypothesised that the Sharingan can be evolved into the Rinnegan by combining Uchiha and Senju DNA. To that end, Kabuto successfully recreated the Rinnegan by infusing Hashirama's cells into Madara's reincarnated body, though these fake eyes did not have full access to the original's abilities. After receiving half of Hagoromo's chakra from his spirit, Sasuke awakened a Rinnegan in his left eye, which contains three tomoe on its two innermost circles for a total of six. In addition to the Rinnegan's power, this eye retains the abilities of Sasuke's left Mangekyō Sharingan, including the ability to cast ocular genjutsu and use Amaterasu. If Sasuke overuses the power of his Rinnegan, his ocular power will temporarily diminish, causing the tomoe in his Rinnegan to vanish until his full power returns. During this time, he is also seemingly unable to activate his right eye's Mangekyō Sharingan or use Susanoo. Momoshiki Ōtsutsuki has a pair of Rinnegan embedded in the palms of his hands. They are initially red, but after he consumes his guardian, Kinshiki, they become purple (in Boruto: Naruto the Movie) or yellow (in Boruto: Naruto Next Generations). This also grants him a third Rinnegan on his forehead, which matches the other two in colour. In the anime, Momoshiki's yellow Rinnegan temporarily turn red when he uses their power. Urashiki Ōtsutsuki manifests his Rinnegan in the same pair of eyes as his Byakugan, and can switch between the two dōjutsu at will. Urashiki's Rinnegan are able to take on several forms to access different abilities: at times, they are red and contain six tomoe, while at other times, they resemble the Rinnegan's standard appearance, but glow blue with a white ripple pattern while using certain techniques. After consuming all of the chakra he had stolen from others, Urashiki removed and devoured both of his Rinnegan, causing him to undergo a transformation. In this form, his eyes were restored, an additional Rinnegan appeared on his forehead, and all of his dōjutsu turned yellow, much like Momoshiki before him. As with any dōjutsu, the Rinnegan can be transplanted into others. Prior to his death, Madara implanted both of his eyes into the young Nagato without the boy's knowledge, and he was able to make effective use of them throughout his life due to his Senju lineage. After Nagato's death, the Rinnegan were taken by Obito Uchiha, who implanted the left eye into himself and hid the other, knowing he could not handle the power of both eyes at once. Madara later reclaimed both of his Rinnegan after he was revived, and they were last seen deactivated upon his death. He was also able to revert his Rinnegan to his Mangekyō Sharingan.",
        "classfication": "Dōjutsu",
        "clan": ["Ōtsutsuki"],
        "image": [
            "https://vignette.wikia.nocookie.net/naruto/images/7/7e/Rinnegan.svg/revision/latest?cb=20171226164549",
            "https://vignette.wikia.nocookie.net/naruto/images/7/7d/Sasuke%27s_Rinnegan.png/revision/latest?cb=20160909022555"
        ]
    },
    {
        "name": "Shikotsumyaku",
        "description": "Shikotsumyaku is a kekkei genkai which gives its wielder the ability to manipulate their own bones. It very rarely manifests within members of the Kaguya clan, of which Kimimaro was the last survivor. Kaguya Ōtsutsuki possessed the ability to manipulate her own skeletal structure, which she most commonly employed via her All-Killing Ash Bones. The Kaguya clan's Shikotsumyaku is a similar, but less lethal, power. Users of Shikotsumyaku possess three unique skills: the ability to control their osteoblasts (cells responsible for producing bones); the ability to control their osteoclasts (cells responsible for breaking down bones); the ability to regulate their bones' calcium density. So long as their body does not tire out, users can take advantage of these abilities without limit. With Shikotsumyaku, users can grow new bones anywhere in their body. Typically these bones are functionally and visually identical to other bones in the body, such as the spine or ribs. Other times the bones will be similar to standard bones, but with specific alterations: Dance of the Camellia uses an upper arm bone that has been sharpened for use as a blade. If the user chooses, they can create entirely original bones with no clear parallels: Dance of the Clematis: Flower uses a large, drill-like bone growth. The user's bones can be made denser, increasing their cutting power and rendering them resistant to crushing or cutting. If the user chooses, hollow bones can be produced, such as for use as a flute. Users can manipulate their bones after or even as they're being formed, causing them to break through the skin. Most often these bones only protrude from the body, enough for the user to grab and remove them or, alternatively, remain jutting out for whatever offensive or defensive purpose the user intends. If the user chooses, the bones can be forcefully ejected from the body, as in the case of Ten-Finger Drilling Bullets. After the bones have either left the body or been retracted into it, the broken skin heals rapidly. If, in the case of removed bones, the user does not already have a duplicate prepared, the relevant body part will be misshapen and unusable until a replacement is produced. Shikotsumyaku gives its users a huge advantage in combat, as they can produce an endless number of bones to suit any conceivable circumstance. Rarely do users encounter real opposition in a fight, for which reason their path through a battlefield is often left littered with dead bodies. On those infrequent occasions when they cannot quickly finish off an opponent, their ability to strengthen their own bones renders them highly resistant to damage, their bodies being likened to a fortress. Due to Shikotsumyaku's unprecedented power and versatility, the Kaguya clan believed themselves to be invincible. This overestimation of themselves led the Kaguya to pick a fight with a superior power, Kirigakure, causing them to be wiped out. Orochimaru, in his quest for immortality, wanted to acquire Shikotsumyaku for himself by taking over Kimimaro's body, but Kimimaro became ill before Orochimaru had the chance. Kabuto Yakushi attempted to heal Kimimaro, but his kekkei genkai made his body so radically different from an average person's that, without sufficient information about his unique physiology, there was nothing Kabuto could do for him. After Kimimaro's death, Kabuto is able to replicate Kimimaro's Shikotsumyaku within his own body. Orochimaru subsequently gains Shikotsumyaku by absorbing the ability from Kabuto.",
        "classfication": "Ninjutsu",
        "clan": ["Kaguya"],
        "image": [
            "https://vignette.wikia.nocookie.net/naruto/images/a/ab/Shikotsumyaku.png/revision/latest?cb=20150125163439"
        ]
    },
    {
        "name": "Tenseigan",
        "description": "The Tenseigan is a dōjutsu introduced in The Last: Naruto the Movie. The movie's novelisation explains that the Tenseigan can be acquired when an Ōtsutsuki is implanted with the Byakugan of a Hyūga: this combination of the two clans' chakra transforms the Byakugan into Tenseigan. When Toneri Ōtsutsuki implants himself with Hanabi Hyūga's Byakugan, the transformation takes several days to complete. As the transformation advances, Toneri experiences increasingly painful pulsations in his eyes that subside with rest. When the Tenseigan is finally achieved, the ordinarily featureless white Byakugan gain blue pupils filled with what resemble overlapping white flower patterns. Toneri plans to use these Tenseigan to destroy the Earth by colliding the Moon into it, and after the Earth's population is wiped out Toneri would use his Tenseigan to revive the planet anew. Before he can follow through on these plans, he is drawn into combat with Naruto Uzumaki. Toneri uses his Tenseigan to animate a gigantic golem that he directs against Naruto. He also enters Tenseigan Chakra Mode, giving him several Truth-Seeking Balls as well as the ability to fly. Although the Tenseigan Chakra Mode's power enables Toneri to do extensive damage to the Moon's surface, the form itself is fragile, dispelling after a single punch to the face from Naruto; when this happens, Toneri's Tenseigan also revert back to Byakugan. The Byakugan are immediately afterwards removed from him. The Last: Naruto the Movie makes several mentions of Hamura Ōtsutsuki's Tenseigan, but most or even all of these turn out to be in reference to an energy vessel with the same name. A passage in the movie's novelisation can be read as the energy vessel having been created after Hamura's death, to preserve the power he wielded in life. Conversely, Retsu no Sho states that the energy vessel was created while Hamura was alive and at his direction. As such, it is unclear whether or not Hamura possessed the dōjutsu version of the Tenseigan, and if he did what he used it for.",
        "classfication": "Dōjutsu",
        "clan": ["Ōtsutsuki"],
        "image": [
            "https://vignette.wikia.nocookie.net/naruto/images/d/d6/Tenseigan_Symbol.svg/revision/latest?cb=20180208143426"
        ]
    }
]
